<?php
/**
 * @var array $correction Spelling and human error correction for Unicode fonts.
 */
$correction = array(
			'ဥ([္်ာ])'=>'ဉ$1',
			'၇([ိီုူှွဲြျ]+)'=>'ရ$1',
			'(ေ)၇([ိီုူှွဲြျ]+)?'=>'ရ$2$1',
			'၈([ိီုူှွဲြျ]+)'=>'ဂ$1',
			'(ေ)၈([ိီုူှွဲြျ]+)?'=>'ဂ$2$1',
			'၀([ိီုူှွဲြျ]+)'=>'ဝ$1',
			'(ေ)၀([ိီုူှွဲြျ]+)?'=>'ဝ$2$1',
			'၀([်ြွႊိီုဳူဴာါ္])'=>'ဝ$1',
			'၀([က-အ])(်)'=>'ဝ$1$2',
			'၇([်ြွႊိီုဳူဴာါ္])'=>'ရ$1',
			'၇([က-အ])(်)'=>'ရ$1$2',
			'၈([်ြွႊိီုဳူဴာါ္])'=>'ဂ$1',
			'၈([က-အ])(်)'=>'ဂ$1$2',
			'(^ျ)([ခဂငဒပဝ])ာ'=>'$1$2ါ',
			'([က-အ])(ြ)ါ'=>'$1$2ာ',
			'([ုူ])([ိီ])'=>'$2$1',
			'([ွှ])(ျ)'=>'$2$1',
			'(ှ)(ွ)'=>'$2$1',
			);
