<?php
/**
 * @file Ayar/WinInnwa-rules-ascii.php	Win Innwa to Ayar conveting rules.
 * @ingroup a_modules
 * 
 */

/**
 * @var array $conv_rules	Win Innwa to Ayar conveting rules array.
 */
$conv_rules = array(
	"ð" => "၀",
	"ï" => "၁",
	"î" => "၂",
	"í" => "၃",
	"ì" => "၄",
	"ë" => "၅",
	"ê" => "၆",
	"é" => "၇",
	"è" => "၈",
	"ç" => "၉",
	"μ" => "က",
	"Õ" => "ခ",
	"1" => "ဂ",
	"Ù" => "ဃ",
	"1⁄2" => "င",
	"-" => "စ",
	"Í" => "ဆ",
	"¦" => "ဇ",
//	"" => "ဈ",
	"a" => "ည",
//	"" => "ဋ",
	"à" => "ဌ",
//	"" => "ဍ",
//	"" => "ဎ",
//	"" => "ဏ",
	"¬" => "တ",
	"Ì" => "ထ",
	"1⁄4" => "ဒ",
	"Ü" => "ဓ",	
	"2" => "န",
	"°" => "ပ",
	"Ð" => "ဖ",
	"3⁄4" => "ဗ",
	"Þ" => "ဘ",
	"3" => "မ",
	"§" => "ယ",
	"®" => "ရ",
	" ́" => "လ",
	"©" => "ဝ",
	" ̄" => "သ",
	" ̧" => "ဟ",
//	"" => "ဠ",
	"ß" => "အ",
	"ù" => "၊",
	"þ" => "။",
	"ø" => "(",
	"÷" => ")",
//	"" => "၎",
//	"" => "ဤ",
//	"" => "၌",
	"Ë" => "ဥ",
	"8" => "ဦ",
//	"" => "၍",
//	"" => "ဿ",
	"×" => "ဣ",
//	"" => "၏",
//	"" => "",
	"Û" => "ဧ",
	"Ä" => "်",
	"·" => "ိ",
	"Â" => "ီ",
	"«" => "ု",
	"±" => "ု", // တစ်ချောင်းငင် အရှည်
	"&" => "ှ",
	"¿" => "ာ",
	"l" => "ျ",
	"x" => "ြ",
	";" => "ြ", // ြ အကြီး 
	"u" => "ဲ",
	"i" => "ွ",
	"â" => "့",
	"É" => "ွှ",
	"å" => "း",
	"»" => "ေ",
	"ó" => "-",

);

/**
 * @var array $order
 * 
 */
$order = array();
