<?php
/**
 * @defgroup ayar Ayar Encoding
 * @brief Rules for converting to Ayar encoding
 * @{
 */

/**
 * @brief Spelling and human error correction for Ayar fonts.
 * @typedef array $correction 
 */
$correction = array(
			'ဥ([္်ာ])'=>'ဉ$1',
			'၇([ိီုူှွဲ]+)?(ေ)'=>'$2ရ$1',
			'၈([ျြိီုူှွဲ]+)?(ေ)'=>'$2ဂ$1',
			'၀([ျြိီုူှွဲ]+)?(ေ)'=>'$2ဝ$1',
			'၀([်ြွႊိီုဳူဴာါ္])'=>'ဝ$1',
			'၀([က-အ])(်)'=>'ဝ$1$2',
			'၇([်ြွႊိီုဳူဴာါ္])'=>'ရ$1',
			'၇([က-အ])(်)'=>'ရ$1$2',
			'၈([်ြွႊိီုဳူဴာါ္])'=>'ဂ$1',
			'၈([က-အ])(်)'=>'ဂ$1$2',
			'(ြ)([က-အ])ါ'=>'$1$2ာ',
			'(?<!ြ)([ခဂငဒပဝ])ာ'=>'$1ါ',
			'([ုူ])([ိီ])'=>'$2$1',
			'([ွှ])(ျ)'=>'$2$1',
			'(ှ)(ွ)'=>'$2$1',
			);
/** @} */ 
