<?php
/**
 * @file ay/zg.php - Zawgyi-One to Ayar
 * @brief Zawgyi-One to Ayar
 * @defgroup zawgyi
 * @ingroup ayar
 */
 
/**
 * @ingroup zawgyi
 * @section zawgyi Zawgyi-One
 * Converting rules for Zawgyi-One to Ayar
 * @var array $conv_rules 
 * @ref unicode
 * @include ayar/zawgyi-one-rules.php
 */
$conv_rules = array(
			'ဳ' => 'ု',
			'ဴ' => 'ူ',
			'္' => '်',
			'်' => 'ျ',
			'ျ' => 'ြ',
			'ြ' => 'ွ',
			'ွ' => 'ှ',
			'ၚ' => 'ါ်',
			'ၠ' => '္က',
			'ၡ' => '္ခ',
			'ၢ' => '္ဂ',
			'ၣ' => '္ဃ',
			'ၤ' => 'င်္',
			'ၥ' => '္စ',
			'ၦ' => '္ဆ',
			'ၧ' => '္ဆ',
			'ၨ' => '္ဇ',
			'ၩ' => '္ဈ',
			'ၪ' => 'ဉ',
			'ၫ' => 'ည',
			'ၬ' => '္ဋ',
			'ၭ' => '္ဌ',
			'ၮ' => 'ဍ္ဍ',
			'ၯ' => 'ဍ္ဎ',
			'ၰ' => '္ဏ',
			'ၱ' => '္တ',
			'ၲ' => '္တ',
			'ၳ' => '္ထ',
			'ၴ' => '္ထ',
			'ၵ' => '္ဒ',
			'ၶ' => '္ဓ',
			'ၷ' => '္န',
			'ၷ' => '္ပ',
			'ၹ' => '္ဖ',
			'ၺ' => '္ဗ',
			'ၻ' => '္ဘ',
			'ၼ' => '္မ',
			'ၽ' => 'ျ',
			'ၾ' => 'ြ',
			'ၿ' => 'ြ',
			'ႀ' => 'ြ',
			'ႁ' => 'ြ',
			'ႂ' => 'ြ',
			'ႃ' => 'ြ',
			'ႄ' => 'ြ',
			'ႅ' => '္လ',
			'ႆ' => 'ဿ',
			'ႇ' => 'ှ',
			'ႈ' => 'ှု',
			'ႉ' => 'ှူ',
			'ႊ' => 'ွှ',
			'ႏ' => 'န',
			'႐' => 'ရ',
			'႑' => 'ဏ္ဍ',
			'႒' => 'ဋ္ဌ',
			'႓' => '္ဘ',
			'႔' => '့',
			'႕' => '့',
			'႗' => 'ဋ္ဋ',
			'၈ၤ'=>'ဂင်္',
			'ဧ။္'=>'၏',
			'၄​င္း'=>'၎င်း',
			'၎'=>'၎င်း',
			'၎င္း'=>'၎င်း',
			'ေ၀' => 'ေဝ',
			'ေ၇' => 'ေရ',
			'ေ၈'=>'ေဂ',
			'စ်'=>'ဈ',
			'ဥ​ာ'=>'ဉာ​',
			'ဥ​္'=>'ဉ်',
			'ၾသ'=>'ဩ',
			'ေၾသာ္'=>'ဪ',
		);



