<?php
/**
 * @file Zawgyi-One/correction.php	Zawgyi-One correction rules.
 * @ingroup z_modules
 * 
 */
 
/*
 * @brief Zawgyi to Unicode correction array
 * @var array $correction Spelling and human error correction for Zawgyi-One font.
 */
$correction = array(
	'ဥ([    ္   ်   ာ])' => 'ဉ$1',
	'(?<![၀-၉])၇(?![၀-၉])' => 'ရ',
	'(?<![၀-၉])၈(?![၀-၉])' => 'ဂ',
	'(?<![၀-၉])၀(?![၀-၉])' => 'ဝ',
	'(?<![ျႃႄႀၿၾႁႂ])(?<=[ခဂငဒပဝ])ာ'=>'ါ',
	'([ျႃႄႀၿၾႁႂ][ခဂငဒပဝ])[ါာ]' => '$1ာ', 
//	'(?<!ေ[ျ    ႃ   ႄ   ႀ   ၿ   ၾ   ႁ   ႂ   ])(?<=[ခဂငဒပဝ])ာ' => 'ါ',
//	'([က-အ])(ြ)ါ' => '$1$2ာ',
	'([ုူ])([ိီ])' => '$2$1',
	'([ွှ])(ျ)' => '$2$1',
	'(ှ)(ွ)' => '$2$1',
	'([ျ    ႃ   ႄ   ႀ   ၿ   ၾ   ႁ   ႂ   ])([က-အ])([ ိ   ီ   ံ   ဲ   ၤ])?ု' => '$1$2$3ဳ',
	'([ျ    ႃ   ႄ   ႀ   ၿ   ၾ   ႁ   ႂ   ])([က-အ])([ ိ   ီ   ံ   ဲ   ၤ])?ူ' => '$1$2$3ဴ',
	'([ျ])([ကဆဏတထဘယလသဟ])([ံီိဲ][ုူ့ြ႔႕])' => 'ႄ$2$3',
	'([ျ])([ကဆဏတထဘယလသဟ])([ံီိဲ])' => 'ႀ$2$3',
	'([ျ])([ကဆဏတထဘယလသဟ])' => 'ၾ$2',
);
