<?php
/**
 * @file Zawgyi-One/Myanmar3-rules.php	Myanmar3 to Zawgyi-One conveting rules.
 * @ingroup z_modules
 * 
 */

/**
 * @var array $conv_rules converting rules for Unicode to Zawgyi-One.
 */
$conv_rules = array(
			'်' => '္',
			'ျ' => '်',
			'ြ' => 'ျ' ,
			'ွ' => 'ြ',
			'ှ' => 'ွ',
			'ါ်' => 'ၚ',
			'ျံ[့႔႕]' => '်ံ႕',
			'္က' => 'ၠ',
			'္ခ' => 'ၡ',
			'္ဂ' => 'ၢ',
			'္ဃ' => 'ၣ',
			'င်္' => 'ၤ',
			'္စ' => 'ၥ',
			'္ဆ' => 'ၦ',
			'္ဇ' => 'ၨ',
			'္ဈ' => 'ၩ',
			'ဉ' => 'ဥ',
			'္ဋ' => 'ၬ',
			'္ဌ' => 'ၭ',
			'ဍ္ဍ' => 'ၮ',
			'ဍ္ဎ' => 'ၯ',
			'္ဏ' => 'ၰ',
			'္တ' => 'ၱ',
			'္ထ' => 'ၳ',
			'္ဒ' => 'ၵ',
			'္ဓ' => 'ၶ',
			'္န' => 'ၷ',
			'္ပ' => 'ၷ',
			'္ဖ' => 'ၹ',
			'္ဗ' => 'ၺ',
			'္ဘ' => 'ၻ',
			'္မ' => 'ၼ',
			'္လ' => 'ႅ',
			'ဿ' => 'ႆ',
			'ှု' => 'ႈ',
			'ှူ' => 'ႉ',
			'ြွ'=>'ႊ',
			'ဏ္ဍ' => '႑',
			'ဋ္ဌ' => '႒',
			'္ဘ' => '႓',
			'ဋ္ဋ' => '႗',
			'၀ေ' => 'ေဝ',
			'၇ေ' => 'ေရ',
			'၈ေ'=>'ေဂ',
			'၎င်း' => '၎',
			'ဉ္'=>'ဥ္',
			'ြ်'=>'်ြ',
			'ွြ'=>'ႊ',
		);

/**
 * @var $order Unicode to Zawgyi-One
 */
$order = array(
			'([့႔႕])([ိီုူ္])' => '$2$1',
			'(ၤ)([က-အ])' => '$2$1',
			//'([ျ်ြ့])(ေ)' => '$2$1',
			'([က-အ])(ေျ|ေ|ျ)' => '$2$1',
			'([က-အ])(ြွ|်ွ|ႊ|ွ)(ေ)' => '$3$1$2',
			'([း၊။])([ိီ့္ဲ])'=>'$2$1',
			'(ု)(ံ)' => '$2$1',
			'(့)(်)'=>'$2$1',
		);
