<?php
/**
 * @file Zawgyi-One/correction.php	Zawgyi-One correction rules.
 * @ingroup z_modules
 * 
 */
 
/*
 * @brief Zawgyi to Unicode correction array
 * @var array $correction Spelling and human error correction for Zawgyi-One font.
 */
$correction = array(
	'ဥ([    ္ ွ ြ   ာ])' => 'ဉ$1',
	'(?<![၀-၉])၇(?![၀-၉၊။])' => 'ရ',
	'(?<![၀-၉])၈(?![၀-၉၊။])' => 'ဂ',
	'(?<![၀-၉])၀(?![၀-၉၊။])' => 'ဝ',
	'(?<=[^ျ][ခဂငဒပဝ])ာ'=>'ါ',
	//'(?<=[^ၠ-ၣၥ-ၩၬၭၰ-ၼႅ႓႖][ခဂငဒပဝ])ာ'=>'ါ',
	'(?<=[ျ][က-အ])([ွြ	ံိီ]+)?ူ' => '$1ဴ',
	'(?<=[ျ][က-အ])([ွြ	ိီံ]+)?ု' => '$1ဳ',
	'(?<=[က-အ][်])([ွြ	ံိီ]+)?ူ' => '$1ဴ',
	'(?<=[က-အ][်])([ွြ	ိီံ]+)?ု' => '$1ဳ',
	'(?<=[ၠ-ၣၥ-ၩၬၭၰ-ၼႅ႓႖])([ွြ	ံိီ]+)?ူ' => '$1ဴ',
	'(?<=[ၠ-ၣၥ-ၩၬၭၰ-ၼႅ႓႖])([ွြ	ိီံ]+)?ု' => '$1ဳ',
	'(?<=[ဥ]ံ)ု' => '$1ဳ',
	'(်ွ|ွ်)' => 'ၽွ',
	'န(?=[ႉူွြ	ၠ-ၣၥ-ၩၬၰ-ၼႅႇ-ႊ-႖])' => 'ႏ',
	'ၤီ' => 'ႌ',
	'ၤိ'	=> 'ႋ',
	'ၤ([	်	])ီ' => 'ႌ$1',
	'ၤ([	်	])ိ'	=> 'ႋ$1',
	'ွု' => 'ႈ',
	'ွူ' => 'ႉ',
	'(?<=[	ု္ြ])့' => '႔',
	'(?<=[	ြ	ွ	ႊ	][	ံဲ	])့' => '႕',
	'(ြွ|ွြ)' => 'ႊ',

	'ျ(?=[ကဆဏတထဘယလသဟ][ံီိဲ][ုူ့ြ႔႕])' => 'ႄ',
	'ျ(?=[ကဆဏတထဘယလသဟ][ံီိဲ])' => 'ႀ',
	'ျ(?=[ကဆဏတထဘယလသဟ][့ြွႊ])' => 'ႂ',
	'ျ(?=[ကဆဏတထဘယလသဟ])' => 'ၾ',
	'ျ(?=[^ကဆဏတထဘယလသဟ][ံီိဲ][ုူ့ြ႔႕])' => 'ႃ ',
	'ျ(?=[^ကဆဏတထဘယလသဟ][ံီိဲ])' => 'ၿ',
	'ျ(?=[^ကဆဏတထဘယလသဟ][့ြွႊ])' => 'ႁ',
	'ျ(?=[^ကဆဏတထဘယလသဟ])' => 'ျ',
);
